tap "heroku/brew"
tap "homebrew/services"
tap "stripe/stripe-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Emacs dependency management
brew "cask"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@77"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Simple terminal UI for git commands
brew "lazygit"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm"
# Language Server for the Lua language
brew "lua-language-server"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux", args: ["HEAD"]
# Manage complex tmux sessions easily
brew "tmuxinator"
# Parser generator tool
brew "tree-sitter-cli"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Image processing library
brew "vips"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Anthropic's official Claude AI desktop app
cask "claude"
# Screen capturing tool
cask "cleanshot"
# Voice and text chat software
cask "discord"
# Web browser
cask "google-chrome"
# GUI client for PostgreSQL databases
cask "postico"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Archive manager for data compression and backups
cask "rar"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Video communication and virtual meeting platform
cask "zoom"
